<html>
<head>
</head>
<body font face="Arial, Helvetica, sans-serif">
<h2><a href="http://ch/aplu/docs/index_de.html"><img src="gifs/home.png" alt="home" width="25" height="25"></a></h2>
<h2>Dokumentation MicroBit Manager (MBM)</h2>
<p>&nbsp;</p>
<h4>Allgemeines:</h4>
<p>Mit dem MicroBit Manager k&ouml;nnen Programme f&uuml;r den micro:bit (oder einem dazu kompatiblen Mikrocontroller, z.B. dem Calliope) mit verschiedenen  Programmeditoren bzw. IDEs entwickelt und dann mit einem Klick auf das Targetsystem hinunter geladen und dort ausgef&uuml;hrt werden. W&auml;hrend der Programmausf&uuml;hrung ist ein interaktives Terminal-Fenster (Console, REPL) ge&ouml;ffnet, in welchem Fehlermeldungen und print()-Ausgaben erscheinen. Mit Ctrl+C kann das Programm abgebrochen werden und der Python-Interpreter zeigt den Prompt &gt;&gt;&gt;. Hierauf kann der Benutzer   Python-Befehle interaktiv ausf&uuml;hren lassen. 
<p>Mit dem MBM l&auml;sst sich zudem die Firmware des Mikrocontrollers flashen. Nach dem Flashen werden zudem einige  n&uuml;tzliche Python Library-Module auf das Target kopiert (Unterst&uuml;tzung von zus&auml;tzlichen Sensoren, Motoren, Tutorials, usw.) enth&auml;lt.
<p>F&uuml;r die Programmentwicklung verbindet man das Mikrocontroller-Board &uuml;ber die USB-Schnittstelle mit dem Entwicklungssystem. Es erscheint dann im Dateisystem des PC als ein neuer externer USB-Device mit einem Laufwerkbuchstaben (Windows) bzw. einem Laufwerknamen (Mac, Linux), ist aber auch als serielles Ger&auml;t (mit einem Com Port) ansprechbar. (Unter Windows-Versionen fr&uuml;her als 10 muss dazu ein mbed-Driver installiert werden, der von <a href="http://www.tigerjython.ch/download/mbed.zip">hier</a> hinuntergeladen werden kann. Ab Windows 10 und unter Mac/Linux ist kein zus&auml;tzlicher Treiber n&ouml;tig.)
<p>Der MicroBit Manager ist in TigerJython integriert und ben&ouml;tigt keine Zusatzinstallationen. Als Standalone-Programm oder zur Integration in andere IDEs kann er von <a href="http://www.tigerjython.ch/download/mbm.zip">hier</a> als Java-Applikation  hinuntergeladen werden (inklusive Source).  Alle Funktionen w&auml;hlt man &uuml;ber Kommandozeilen-Parameter aus, die beim Aufruf ohne Parameter aufgelistet werden (<em>java -jar MBM.jar).</em>
<p>Um den MBM in TigerJython zu aktivieren, w&auml;hlt man unter <em>Einstellungen | Bibliotheken | Roboter</em> ausw&auml;hlen die Option <em>micro:bit/Calliope</em>. Es erscheint dann in der Taskleiste ein zus&auml;tzlicher schwarz-umrandeter Button und im Men&uuml; Tools werden die Optionen <em>Remote Terminal, Hinunterladen/Ausf&uuml;hren, Modul hinunterladen, Flash Target</em> frei geschaltet.
  <br>
  <br>
<h4><br>
Entwicklungsprozess:</h4>
<p>Die Source wird im Editorfenster von TigerJython geschrieben und gleich wie andere Pythonprogramme auf dem Entwicklungssystem abgespeichert. Da die Programmausf&uuml;hrung nicht auf dem Entwicklungssystem, sondern auf dem Target erfolgt, wird zur Ausf&uuml;hrung nicht der gr&uuml;ne, sondern der schwarz-umrandete Button geklickt  oder die Option <em>Hinunterladen/Ausf&uuml;hren</em> gew&auml;hlt. Vor dem Hinunterladen &uuml;berpr&uuml;ft der in TigerJython eingebaute Python-Parser die Syntax und Fehler werden in benutzerfreundlicher Form direkt neben der Fehlerstelle im Editor angezeigt. Findet der Parser keine Fehler, so &ouml;ffnet sich ein zus&auml;tzliches Terminal-Fenster (REPL), in dem die Kommunikation mit dem Target stattfindet. Diese umfasst folgende automatisch ablaufenden Schritte:
<ul>
  <li>Anhalten eines laufenden Programms</li>
  <li>Hinunterladen der Sourcedatei und Speicherung als <em>main.py</em> (ein bestehende Datei wird &uuml;berschrieben)</li>
  <li>Aufruf von Ctrl+D, was einen Soft-Boot bewirkt, der <em>main.py</em> startet.</li>
</ul>
<p>Alle print()-Ausgaben und Laufzeit-Fehlermeldungen werden im Terminal-Fenster ausgeschrieben und durch Eintippen von Ctrl+C kann die Programmausf&uuml;hrung gestoppt werden. Nachher erscheint wieder der Prompt &gt;&gt;&gt; des Python-Interpreters und Befehlszeilen k&ouml;nnen eingegeben und unmittelbar ausgef&uuml;hrt werden.  Ctrl+D erzwingt  einen Soft-Boot, der <em>main.py</em> neu startet.
<p>Da beim Hinunterladen  ein  bereits laufendes automatisch Programm gestoppt wird, ist es erlaubt, nicht abbrechende Programme bzw. Endlosschleifen zu verwenden, wie dies bei der Microcontroller-Entwicklung in C und Assembler &uuml;blich ist. Diese sollten aber den Prozessor nicht zu stark belasten, da sonst das Abbrechen mit Ctrl+C misslingen kann (in engen Schleifen empfiehlt sich der Einbau von <em>sleep(0.001)</em>).
<p>Zur Unterst&uuml;tzung strukturierter Programmierung k&ouml;nnen mit der Option <em>Modul hinunterladen</em> auch Python-Module ohne Namens&auml;nderung auf das Target-System kopiert und mit den &uuml;blichen import-Anweisungen eingebunden werden. Ungl&uuml;cklicherweise ist wegen des bescheidenen Speicherplatzes die Gr&ouml;sse der Programme auf einige kBytes beschr&auml;nkt.
<p>Nachdem ein Programm hinuntergeladen (und automatisch in <em>main.py</em> umbenannt) wurde, kann die USB-Verbindung zum Entwicklungssystem abgeh&auml;ngt werden. Jedesmal beim Anschluss einer 5V-Spannungsquelle (USB-Ladeger&auml;t, USB-Powerbank, usw.) wird das Programm <em>main.py</em> sofort wieder ausgef&uuml;hrt.
<p>H&auml;ngt sich <em>main.py</em> auf oder l&auml;sst sich das Target wegen einer Software-Fehlmanipulation nicht mehr ansprechen, kann  durch Flashen   ein neues System aufgesetzt werden. Dabei werden  auch alle Programmmodule gel&ouml;scht, sodass diese vom Entwicklungssystem wiederhergestellt werden m&uuml;ssen.
<p>Der Python-Interpreter <em>MicroPython</em> ist keine vollst&auml;ndige Implementierung von  Python 3.x, aber die meisten gewohnten Sprachelemente sind verf&uuml;gbar. Die spezielle Hardware des Target wird &uuml;ber das Modul <em>microbit</em> bzw. <em>calliope_mini</em> unterst&uuml;tzt. Dazu importiert man dieses mit <em>from microbit import * </em> bzw. <em>from calliope_mini import * </em> (eine vollständige englischsprachige Dokumentation für den micro:bit (und kompatible) findet man <a href="http://microbit-micropython.readthedocs.io/en/latest/microbit_micropython_api.html">hier</a>)  . <br>
  <br>

<h4>MBM API:</h4>
<p>Als zus&auml;tzliches Feature k&ouml;nnen die Operationen des MBM auch mit einem Pythonprogramm aufgerufen werden, das in TigerJython l&auml;uft. Es stehen nach <em>import mbm </em>folgende Funktionen zur Verf&uuml;gung:<br>

<h4>Modul Import: from mbm import *</h4>
<table width="100%"  border="1" cellpadding="3" cellspacing="0" bordercolor="#CCCCCC">
  <tr>
    <td width="22%" bgcolor="#F0F0F5">Funktion</td>
    <td width="78%" bgcolor="#F0F0F5">Aktion</td>
  </tr>
  <tr>
    <td> showFiles()</td>
    <td>
      <p>schreibt alle Dateien aus, die sich auf dem Target befinden<br>
      </p>    </td>
  </tr>
  <tr>
    <td>openTerminal()</td>
    <td>&ouml;ffnet ein Terminalfenster (REPL) und stellt die Verbindung mit dem Target her</td>
  </tr>
  <tr>
    <td>extract(filename)</td>
    <td>kopiert die Datei filename vom Target unter dem gleichen Namen in das Verzeichnis, in dem sich das TigerJython-Programm befindet</td>
  </tr>
  <tr>
    <td>copy(filename)</td>
    <td>
      <p>kopiert die Datei filename mit gleichbleibendem Namen  auf das Target. Ein mit angegebener Pfadbezeichner wird abgeschnitten</p>    
    </td>
  </tr>
  <tr>
    <td>run(filename)</td>
    <td>&ouml;ffnet eine Terminalfenster (REPL) und kopiert die Datei filename auf das Target. F&uuml;hrt dort eine  Umbenennung in main.py durch und f&uuml;hrt das Programm aus. Ein mitangegebener Pfadbezeichner wird abgeschnitten</td>
  </tr>
  <tr>
    <td>runMain()</td>
    <td>&ouml;ffnet ein Terminalfenster (REPL) und f&uuml;hrt  main.py aus (falls vorhanden)</td>
  </tr>
  <tr>
    <td>flash()</td>
    <td>installiert  die Firmware mit einer internen Flash-Imagedatei</td>
  </tr>
  <tr>
    <td>flash(filename)</td>
    <td>installiert  die Firmware mit der angegebenen externen Flash-Imagedatei</td>
  </tr>
  <tr>
      <td>enableDataCapture(enable)</td>
      <td>aktiviert/deaktiviert das Auffangen von Textzeilen im Terminalfenster. Die Zeilen werden in einem Textbuffer (Liste mit Strings) angef&uuml;gt</td>
  </tr>
  <tr>
      <td>getDataLines()</td>
      <td>gibt eine Liste aller Zeilen des Textbuffers zur&uuml;ck und l&ouml;scht den Buffer</td>
  </tr>
  <tr>
      <td> isTerminalDisposed()<br>
      </td>
      <td>gibt True zur&uuml;ck, falls das Terminalfenster nicht sichtbar ist (noch nicht ge&ouml;ffnet oder wieder geschlossen)</td>
  </tr>
</table>

<p>Typische Beispielanwendung (Datenlogger): Mit <em>extract(filename)</em> werden die in einer Datei auf dem Target gespeicherten Daten zum PC transferiert und dort weiter verarbeitet.</p>
<h4><a href="http://ch/aplu/docs/index_de.html"></a><a href="http://ch/aplu/docs/index_de.html"><img src="gifs/home.png" alt="home" width="25" height="25"></a></h4>
<p>&nbsp;</p>
</body>
</html>

