<html>
<head>
</head>
<body font face="Arial, Helvetica, sans-serif">
 
  
  <blockquote>
    <p><a href="http://ch/aplu/docs/index_de.html"><img src="gifs/home.png" alt="home" width="25" height="25"></a></p>
    <h2>NXT installieren</h2>
    <h2>&nbsp;    </h2>
    
    <p>Voraussetzung: Auf dem NXT-Brick ist die <em>leJOS- oder LEGO</em>-Firmware installiert. (Weitere Informationen &uuml;ber die Einrichtung des NXT-Roboters erfahren Sie <a href="http://www.java-online.ch/lego/index.php?inhalt_links=NxtDirekt/nav_op.inc.php&inhalt_mitte=nxtinstall/java_firmware.inc.php&navN=nxtinstall/java_firmware.inc.php">hier</a>.)</p>
    <h3><strong>1 NXT  via Bluetooth verbinden</strong></h3>
    <p>Im direkten Modus (Remote-Steuerung) kommuniziert der PC w&auml;hrend der Programmausf&uuml;hrung mit dem NXT-Brick  &uuml;ber eine Bluetooth-Verbindung. Damit dies funktioniert, muss eine JAR-Datei von Bluecove  auf Ihrem Computer im Unterverzeichnis Lib des Verzeichnisses, in dem sind <em>tigerjython2.jar</em> befindet, gespeichert sein. Sie k&ouml;nnen diese Datei von hier herunterladen (Verbindung zum Internet n&ouml;tig).<br />
   </p>
    <p><a href="http://clab5.phbern.ch/jython/download/bluecove-2.1.1.jar">Download bluecove-2-1-1.jar </a> (Windows)<br />
          <a href="http://clab5.phbern.ch/jython/download/bluecove-gpl-2.1.1-SNAPSHOT.jar">Download bluecove-gpl-2.1.1-SNAPSHOT.jar </a> (Mac, Linux)</p>
    <p>Vor der ersten Verwendung m&uuml;ssen die Bluetooth-Ger&auml;te gepaart werden. Gehen Sie so vor, wie Sie es mit irgendeinem anderen Bluetooth-Ger&auml;t (Smartphone, usw.) gewohnt sind.</p> 
    <ul>
      <li>&Uuml;berpr&uuml;fen Sie, ob Bluetooth auf dem NXT und dem PC aktiviert ist</li>
      <li>&Ouml;ffnen Sie den Bluetooth-Ger&auml;temanager und f&uuml;hren Sie eine Ger&auml;tesuche durch</li>
      <li>Sobald der NXT sichtbar wird, <font size="3">f&uuml;gen Sie ihn als neues Ger&auml;t hinzu</li>
      <li> Sie werden aufgefordert, die Kennung (Sicherheitscode) des Ger&auml;tes einzugeben</li>
      <li> Geben Sie  1234 ein und best&auml;tigen Sie (Standard f&uuml;r den NXT-Brick)</li>
    </ul>
    <h3><strong> 2 Programm editieren und  ausf&uuml;hren</strong></h3>
    <ul>
      <li>Starten Sie  TigerJython und geben Sie ein Programm ein  </li>
    </ul>
    <blockquote>
      <p><img src="gifs/ev3myfirst_de.png" alt="" width="635" height="480" />     </p>
    </blockquote>
    <ul>
      <li>Klicken Sie auf die Ikone <em> Ausf&uuml;hren</em> (gr&uuml;ner Pfeil)</li>
      <li>In einer Dialogbox wird nach der Bluetooth-Namen des NXT-Bricks gefragt. Diese ist standardm&auml;ssig auf NXT gesetzt<br>
      <br>
      <img src="gifs/btname1.png" alt="" width="200" height="92" /><br>
      <br>
      </li>
      <li>Danach wird  die Verbindung zum NXT aufgebaut. Ist der Verbindungsaufbau erfolgreich, so wird dies in einem Dialogfenster angezeigt und die Programmausf&uuml;hrung <strong>im direkten Modus</strong> gestartet. <br>  
      <br>
      </li>
    </ul>
    <blockquote>
      <p><img src="gifs/btconnect.png" alt="" width="371" height="125" border="1" /></p>
      <p>&nbsp;</p>
    </blockquote>
    <ul>
      <li>Falls der NXT   mit 2 Motoren an den Ports A und B ausgestattet ist, f&auml;hrt er eine kurze Strecke vorw&auml;rts. Mit <em>robot.exit()</em> wird die Verbindung unterbrochen und das Programm beendet. Die Verbindung  kann jederzeit auch durch Schliessen des Dialogfensters unterbrochen werden.</li>
    </ul>
    <p>
      </ul>
      
      <a href="http://ch/aplu/docs/index_de.html"><img src="gifs/home.png" alt="home" width="25" height="25"></a>  
    </p>
  </blockquote>
 
<p>&nbsp;</p>
<p>&nbsp;</p>  
<p>&nbsp;</p>
<p>&nbsp;</p>
</body>
</html>